<!--
TODO LIST
1. [ ] Отваливается ctrl+z (ctrl+shift+z)
2. [X] Кривое перемещение всех квестов при движении квестов влево/вверх
3. [ ] Выравнивание по сетке
4. [X] При нажатии на квест в режиме редактирования он смещается на пиксель
5. [ ] Заголовок на главной странице внутри линии (как сделан ник)
6. [ ] Общее редактирование описаний/зависимостей для нескольких квестов
7. [X] Расположение кнопки редактирования, сохранения и тд
8. [ ] Актуальные иконки и список предметов с последних вайпов
9. [X] Поделить код на компоненты
10. [ ] Захостить сайт
11. [ ] Нет возможности менять названия предметов
12. [ ] Адаптация под разные мониторы
13. [ ] Адаптация размеров названий предметов в PreventQuest
14. [X] Кастомные таски (customDescription) у предметов в PreventQuest
15. [ ] Сделать адекватный рендер надписи в index.html
16. [ ] Избавиться от jQuary
17. [X] Не до конца доходит хендлер изменения ширины sidebar
18. [X] Валидация файлов
19. [X] Оптимизация перемещения квестов при большом кол-ве квестов
20. [X] Редактирование sortIndex
-->

<template>
  <router-view/>
</template>